In [593]:
import numpy as np
import pandas as pd

In [594]:
d = {
       "apples": pd.Series([3, 2, 0,1]),
        "oranges": pd.Series([0, 3, 7, 2]),
    }

df=pd.DataFrame(d)

In [595]:
df

   apples  oranges
0       3        0
1       2        3
2       0        7
3       1        2

In [596]:
mask=df['apples']>2
df.loc[mask,'apples']='Fruit2'
#df['apples'][df['apples']>2]='fruit2'

In [597]:
df.iloc[1,1]='Fancy'
df

   apples oranges
0  Fruit2       0
1       2   Fancy
2       0       7
3       1       2

In [598]:
df['apples']=list(map(lambda x: x[0:-1] if type(x)==str else x,df['apples']))
df

  apples oranges
0  Fruit       0
1      2   Fancy
2      0       7
3      1       2

In [599]:
df

  apples oranges
0  Fruit       0
1      2   Fancy
2      0       7
3      1       2

In [600]:
df.rename(columns={"apples":"newname"},inplace=True)

In [601]:
df

  newname oranges
0   Fruit       0
1       2   Fancy
2       0       7
3       1       2

In [602]:
old=[1,2,3]
new=[4,5,6]
df.replace(dict(zip(old,new)),inplace=True)
df

  newname oranges
0   Fruit       0
1       5   Fancy
2       0       7
3       4       5

In [608]:
def tester(x):
    if type(x)!=str:
        return x
    else:
        return str(x.lower())

df


df = df.applymap(lambda s:s.lower() if type(s) == str else s)
df

  newname oranges
0   fruit       0
1       5   fancy
2       0       7
3       4       5

  newname oranges
0   Fruit       0
1       6   Fancy
2       1       7
3       5       5